# St7SetElementProperty

Sets the property for the specified element. The property does not need to be created in advance.

long St7SetElementProperty(long uID, long Entity, long EntityNum, long PropNum)

Input Parameters

uID

Strand7 model file ID.

Entity

One of ptBEAMPROP, ptPLATEPROP or ptBRICKPROP.

EntityNum

Entity number.

PropNum

Property number.